### Ordinal Number Encoding

ranking cate

In [1]:
import datetime

In [5]:
today_date=datetime.datetime.today() #will give todays date
today_date

datetime.datetime(2023, 6, 26, 10, 3, 8, 519749)

In [6]:
today_date-datetime.timedelta(3) # will give me diff of 3 days means minus 3 days

datetime.datetime(2023, 6, 23, 10, 3, 8, 519749)

In [8]:
#### List Comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]
days

[datetime.datetime(2023, 6, 26, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 25, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 24, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 23, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 22, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 21, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 20, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 19, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 18, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 17, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 16, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 15, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 14, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 13, 10, 3, 8, 519749),
 datetime.datetime(2023, 6, 12, 10, 3, 8, 519749)]

In [12]:
# days.head() #this is nto a dataframe so error

In [11]:
import pandas as pd
data = pd.DataFrame(days) # was in list converted into dataframe
data.columns = ['Day']
data.head()

                         Day
0 2023-06-26 10:03:08.519749
1 2023-06-25 10:03:08.519749
2 2023-06-24 10:03:08.519749
3 2023-06-23 10:03:08.519749
4 2023-06-22 10:03:08.519749

In [29]:
# data.Day.dt.year
# data.Day.dt.day
# data.Day.dt.date
# data.Day.dt.month
# data.Day.dt.minute

data['Weekdays'] = data['Day'].dt.day_name()

data.head()

                         Day  Weekdays
0 2023-06-26 10:03:08.519749    Monday
1 2023-06-25 10:03:08.519749    Sunday
2 2023-06-24 10:03:08.519749  Saturday
3 2023-06-23 10:03:08.519749    Friday
4 2023-06-22 10:03:08.519749  Thursday

In [31]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [33]:
data['weekday_ordinal']=data['Weekdays'].map(dictionary)
data

                          Day   Weekdays  weekday_ordinal
0  2023-06-26 10:03:08.519749     Monday                1
1  2023-06-25 10:03:08.519749     Sunday                7
2  2023-06-24 10:03:08.519749   Saturday                6
3  2023-06-23 10:03:08.519749     Friday                5
4  2023-06-22 10:03:08.519749   Thursday                4
5  2023-06-21 10:03:08.519749  Wednesday                3
6  2023-06-20 10:03:08.519749    Tuesday                2
7  2023-06-19 10:03:08.519749     Monday                1
8  2023-06-18 10:03:08.519749     Sunday                7
9  2023-06-17 10:03:08.519749   Saturday                6
10 2023-06-16 10:03:08.519749     Friday                5
11 2023-06-15 10:03:08.519749   Thursday                4
12 2023-06-14 10:03:08.519749  Wednesday                3
13 2023-06-13 10:03:08.519749    Tuesday                2
14 2023-06-12 10:03:08.519749     Monday                1

#### Count Or Frequency Encoding

In [34]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [39]:
train_set[1].unique()  # [1]-index values - array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
train_set.columns #Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64')

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64')

In [41]:
columns=[1,3,5,6,7,8,9,13]

In [42]:
train_set=train_set[columns]
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [58]:
# for feature in train_set.columns[:]:

for co in train_set:
    print(co , ':' , len(train_set[co].unique()),'unique labels')

Employment : 9 unique labels
Degree : 16 unique labels
Status : 7 unique labels
Designation : 15 unique labels
family_job : 6 unique labels
Race : 5 unique labels
Sex : 2 unique labels
Country : 42 unique labels

In [66]:
country_map = train_set.Country.value_counts().to_dict()
# we wanted to map so we converted into dict

In [68]:
train_set['Country']=train_set['Country'].map(country_map)

In [69]:
train_set.head(20)

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

##### Advantages
1. Easy To Use
2. Not increasing the feature space
##### Disadvantages
1. It will provide same weight if the frequencies are same
   it cant hadle same freq cate,like if 2 cate have same count  then it may be issues

#### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

which ever feature is having highest survival rate we r assigning them with high rank from targeted features

In [88]:
import pandas as pd
df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [89]:
df.Cabin.fillna('Missing',inplace = True)

In [90]:
df.Cabin.str[0] # will give me the 1st letter 
# df.Cabin.astype(str)[0] #Missing - just gave me the value present in th einex 9

0      M
1      C
2      M
3      C
4      M
      ..
886    M
887    B
888    M
889    C
890    M
Name: Cabin, Length: 891, dtype: object

In [92]:
df.Cabin = df.Cabin.str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [93]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [96]:
df.groupby(['Cabin'])['Survived'].mean()

# we are grouping Cabin col depending on survived col
# it says that chances of people surviving from each cabin

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [107]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index
# df.groupby(['Cabin'])['Survived'].mean().sort_values()

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [97]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [98]:
enumerate(ordinal_labels,0)

In [109]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [100]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

In [ ]:
# which ever feature is having highest value we r assigning them with high rank from targeted features

#### Mean Encoding

In [101]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [102]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [103]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

In [110]:
# mean encoding leads with overfitting